Revit 2027 API
ConceptualConstructionType.IsValidConceptualConstructionId Method
 Indicates if the ElementId is an id of a ConceptualConstructionType.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidConceptualConstructionId(
	Document ccda,
	ElementId constructionTypeId
)
Public Shared Function IsValidConceptualConstructionId (
	ccda As Document,
	constructionTypeId As ElementId
) As Boolean
public:
static bool IsValidConceptualConstructionId(
	Document^ ccda,
	ElementId^ constructionTypeId
)
static member IsValidConceptualConstructionId :
        ccda : Document *
        constructionTypeId : ElementId -> bool
Parameters
ccda Document
 The document.
constructionTypeId ElementId
 The ElementId of the ConceptualConstructionType.
Return Value
Boolean
 Returns true if is an id of a ConceptualConstructionType, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace